Revit 2027 API
Document.Export(String, IList<ElementId>, PDFExportOptions) Method
 Exports a selection of views in PDF format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Export(
	string folder,
	IList<ElementId> viewIds,
	PDFExportOptions options
)
Public Function Export (
	folder As String,
	viewIds As IList(Of ElementId),
	options As PDFExportOptions
) As Boolean
public:
bool Export(
	String^ folder,
	IList<ElementId^>^ viewIds,
	PDFExportOptions^ options
)
member Export :
        folder : string *
        viewIds : IList<ElementId> *
        options : PDFExportOptions -> bool
Parameters
folder String
 Output folder, into which file(s) will be exported. The folder must exist.
viewIds IList<ElementId>
 Selection of ordered views to be exported. The list must contain at least one valid view.
options PDFExportOptions
 Various options applicable to the PDF format.
Return Value
Boolean
 True if all specified views are exported successfully, False if exporting of any view fails, even if some views might have been exported successfully.
Exceptions
Exception | Condition
ArgumentException |  non empty list of views must be provided. -or- NullOrEmpty -or- There are duplicate views in viewIds -or- some of the views are not printable (exportable). -or- Thrown when one or more input arguments are invalid.
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Thrown when the target PDF file is inaccessible, e.g. already opened.
InvalidOperationException |  "Running background tasks is disabled when DisableBackgroundProcesses is set in Revit.ini." -or- "A background process is already running in this document." -or- "The maximum number of background processes (3) has been reached." -or- Cannot export PDF in the background while in edit mode. -or- Running background tasks is not allowed in a Family document. -or- Export is temporarily disabled. -or- Exporting is not allowed in the current application mode.
InvalidPathArgumentException |  The folder does not exist.
See Also
Reference
Document Class
Export Overload
Autodesk.Revit.DB Namespace